content-org/all-posts.zh-cn.org
#+hugo_base_dir: ../

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+options: author:nil

** DONE 炒饭周摘 2023-04-23
CLOSED: [2023-04-30 Sun 10:22]
:PROPERTIES:
:EXPORT_FILE_NAME: weekly-summary-2023-04-23.zh-cn.md
:EXPORT_DATE: <2023-04-30 Sun>
:CUSTOM_ID: weekly-summary-2023-04-23-zh
:EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :featuredImage /ox-hugo/weekly-summary-2023-04-23-cover.jpeg
:EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :featuredImagePreview /ox-hugo/weekly-summary-2023-04-23-preview.jpeg
:END:
封面是新入手的定制克苏鲁风格的键帽和航插数据线， 好喜欢
#+hugo: more

*** 读了什么
**** [[https://book.douban.com/subject/36155568/][大医·日出篇]]
开始看马亲王的【大医】 第二部， 还是蛮喜欢第一部的， 拿到第二部后现在才抽出时间开始看，希望这周能看完。
****  [[https://sspai.com/post/79450][一次做近视屈光手术（ICL 晶体植入）的流水账 - 少数派]]
我有时候一直在想， 自己要不要去做手术治好跟随我20多年的近视眼， 可一想到要在眼睛上动刀子，心理的恐惧就疯狂袭来。 想起疫情前有看到似乎有种新的视力校正手术，无痛五分钟做完， 不知道什么时候会看到。
*** 看了什么
**** [[https://www.imdb.com/title/tt7660850/episodes?season=1][Succession S1]]
第一季看完了， 确实精彩， 当物质需求已经到达上限后，人最在乎的思惑只有精神需求。
**** [[https://www.imdb.com/title/tt10954600/][Ant-Man and the Wasp: Quantumania (2023)]]
效果很华丽的漫威烂片， 第四阶段的漫威宇宙真的没什么好看的， 幸亏没有跑到电影院花冤枉钱。 不过 [[https://www.imdb.com/name/nm0748620/?ref_=tt_cl_i_1][Paul Rudd]] 是怎么做到一点都不老的？
**** [[https://www.youtube.com/watch?v=TESNhgSeTTw&ab_channel=SkillUp][I played Tears of the Kingdom (spoiler-free hands-on impressions) - YouTube]]
真实等不及， 看得心痒痒， 真的一刻都不想等了
#+begin_export html
{{< youtube TESNhgSeTTw >}}
#+end_export

*** 做了什么
**** [[https://github.com/koekeishiya/yabai][yabai]] & [[https://github.com/koekeishiya/skhd][skhd]]
我惊讶自己现在才发现 yabai 这么好用的窗口管理工具， 用了之后真的是爱不释手！ 解决了很多我以前的使用痛点。 而且也给我机会好好使用 Mac 的多桌面。 花了一个晚上把自己的工作和个人 MBP 都配置了， 用了一周后，我就知道我已经离不开它了
**** [[https://www.gnu.org/software/stow/][Stow]]
我的 dotfiles 管理一直都有点随心所欲， 但是 yabai 和 skhd 让我意识到 多个系统的 dotfiles 的同步已经迫在眉睫， 我之前是自己写的 script 来同步的， 这次用上了 Stow， 同时把 emacs 的 config 也搬了过去。
基本照抄了 [[https://www.youtube.com/@SystemCrafters][System Crafters]] 的设置
#+begin_export html
{{< youtube 90xMTKml9O0 >}}
#+end_export

**** [[https://www.sonos.com/en-au/shop/two-room-set-era-100-white][Sonos Era 100]]
非常幸运的用七折的价钱买到了 Sonos 上个月才出的新的音响， 后来证实七折的打折码是员工失误造成， 但是对于在那一小时下单的交易， Sonos 还是很大方的发货了。 入手后真的很高兴， 家里的这一套家庭影像算是有了完全体, 用这一套看了 [[https://www.imdb.com/title/tt10954600/][Ant-Man and the Wasp: Quantumania (2023)]]， 效果还是很不错的
- [[https://www.sonos.com/en-au/shop/arc][Arc]]
- [[https://www.sonos.com/en-au/shop/sub][Sub]]
- [[https://www.sonos.com/en-au/shop/two-room-set-era-100-white][Sonos Era 100]]

